#############################################################################
# 第〇章 前言
# 第〇节 我唯一想说的废话，是"我不想说废话"
#############################################################################

# ---------------------------------------------------------------------------
# 关于本教程：我希望探索出一条最简单最快速的学习python的方法
# python版本: python3
# 电脑系统: macOS
# 集成开发环境: pycharm
# 备注：如果你是纯小白，从未学过编程，我希望你在学习本课程的时候，不要因为个别地方看不懂，
# 就卡在那里，停止不前，你只需要跟着代码块，一直写下去，慢慢就会豁然开朗了。
# 独白：个人很反感网上的一些python教程，因为他们在课程初期用terminal或IDLE教学，
# 也很反感那些讲师讲一大堆无关紧要的东西，真的特别浪费时间，唉，无力吐槽，我们直接开始吧
# ---------------------------------------------------------------------------

# ┌──────────────────────────────── 知识点一 ────────────────────────────────┐
# 知识点一：
# 下载并安装pycharm(下载地址：www.jetbrains.com/pycharm/download/)
# 运行pycharm
# 点击Create New Project
# 然后参考图片（https://github.com/chaoshenglu/learnPythonEasily/项目配图/1.jpg）
# 恭喜你，创建项目成功
# └─────────────────────────────────────────────────────────────────────────┘
